DATA CLEANING

In [ ]:
import warnings
warnings.filterwarnings("ignore")

In [69]:
import pandas as pd

df = pd.read_csv("raw.csv")

In [70]:
df.columns

Index(['year', 'month', 'circle', 'type_of_connection', 'service_provider',
       'value', 'unit', 'notes'],
      dtype='object')

In [71]:
df.head()

,year,month,circle,type_of_connection,service_provider,value,unit,notes
0,2025,April,Andhra Pradesh,wireless,Bharti Airtel (Including Tata Tele.),33965795,value in absolute number,NaN
1,2025,April,Assam,wireless,Bharti Airtel (Including Tata Tele.),12314102,value in absolute number,NaN
2,2025,April,Bihar,wireless,Bharti Airtel (Including Tata Tele.),40967773,value in absolute number,NaN
3,2025,April,Delhi,wireless,Bharti Airtel (Including Tata Tele.),18877637,value in absolute number,NaN
4,2025,April,Gujarat,wireless,Bharti Airtel (Including Tata Tele.),12401101,value in absolute number,NaN

In [72]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70728 entries, 0 to 70727
Data columns (total 8 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   year                70728 non-null  int64
 1   month               70728 non-null  object
 2   circle              70728 non-null  object
 3   type_of_connection  70728 non-null  object
 4   service_provider    70728 non-null  object
 5   value               58396 non-null  object
 6   unit                70728 non-null  object
 7   notes               511 non-null    object
dtypes: int64(1), object(7)
memory usage: 4.3+ MB

In [73]:
df.describe()

               year
count  70728.000000
mean    2016.026298
std        4.748129
min     2009.000000
25%     2012.000000
50%     2016.000000
75%     2020.000000
max     2025.000000

In [74]:
df = df.drop(columns = ['unit'])

In [75]:
df = df.drop(columns = ['notes'])

In [76]:
df.columns

Index(['year', 'month', 'circle', 'type_of_connection', 'service_provider',
       'value'],
      dtype='object')

In [77]:
#check for missing values
df.isnull().sum()

year                      0
month                     0
circle                    0
type_of_connection        0
service_provider          0
value                 12332
dtype: int64

In [78]:
# Convert to numeric  (in case there are strings)

df['year'] = pd.to_numeric(df['year'], errors='coerce').astype(int)
df['value'] = pd.to_numeric(df['value'], errors='coerce')

In [79]:
# Fill missing values with median
df['value'] = df['value'].fillna(df['value'].median())

In [80]:
df.isnull().sum()

year                  0
month                 0
circle                0
type_of_connection    0
service_provider      0
value                 0
dtype: int64

In [81]:
df.columns

Index(['year', 'month', 'circle', 'type_of_connection', 'service_provider',
       'value'],
      dtype='object')

In [82]:
df.isnull().any()

year                  False
month                 False
circle                False
type_of_connection    False
service_provider      False
value                 False
dtype: bool

In [83]:
df['value'] = pd.to_numeric(df['value'], errors='coerce').astype(int)

In [84]:
df.dtypes

year                   int64
month                 object
circle                object
type_of_connection    object
service_provider      object
value                  int64
dtype: object

OUTLIERS  :  
           --> An outlier is a data point that is very different from the rest of the data.It’s much higher or much lower than most other values in a column.

In [85]:
df['value'].max()

np.int64(476527220)

In [86]:
df['value'].min()

np.int64(0)

In [87]:
Q1 = df['value'].quantile(0.25)
Q3 = df['value'].quantile(0.75)

print(Q1)
print(Q3)

59978.5
3822332.0

In [88]:
IQR = Q3 - Q1

lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

print(lower_limit)
print(upper_limit)

-5583551.75
9465862.25

In [89]:
Q1 = df['value'].quantile(0.25)
Q3 = df['value'].quantile(0.75)
IQR = Q3 - Q1

# Define bounds
lower_limit = Q1 - 1.5 * IQR
upper_limit = Q3 + 1.5 * IQR

# Find outliers
outliers = df[(df['value'] < lower_limit) | (df['value'] > upper_limit)]
print(outliers)

       year     month          circle type_of_connection  \
0      2025     April  Andhra Pradesh           wireless
1      2025     April           Assam           wireless
2      2025     April           Bihar           wireless
3      2025     April           Delhi           wireless
4      2025     April         Gujarat           wireless
...     ...       ...             ...                ...
70345  2009       May       All India           wireline
70442  2009     April       All India           wireline
70538  2009     March       All India           wireline
70632  2009  February       All India           wireline
70727  2009   January       All India           wireline

                           service_provider     value
0      Bharti Airtel (Including Tata Tele.)  33965795
1      Bharti Airtel (Including Tata Tele.)  12314102
2      Bharti Airtel (Including Tata Tele.)  40967773
3      Bharti Airtel (Including Tata Tele.)  18877637
4      Bharti Airtel (Including Tata Tele.)  12401101
...                                     ...       ...
70345                                  BSNL  28975972
70442                                  BSNL  29149831
70538                                  BSNL  29346431
70632                                  BSNL  29229427
70727                                  BSNL  29291013

[8245 rows x 6 columns]

In [90]:
print(df['value'].max())
print(df['value'].min())

476527220
0

In [91]:
print(df['circle'].unique())

['Andhra Pradesh' 'Assam' 'Bihar' 'Delhi' 'Gujarat' 'Haryana'
 'Himachal Pradesh' 'Jammu and Kashmir' 'Karnataka' 'Kerala' 'Kolkata'
 'Madhya Pradesh' 'Maharashtra' 'Mumbai' 'North East' 'Odisha' 'Punjab'
 'Rajasthan' 'Tamil Nadu' 'Uttar Pradesh (East)' 'Uttar Pradesh (West)'
 'West Bengal' 'All India' 'All india' 'Tamil Nadu (including Chennai)'
 'Chennai' 'Andaman and Nicobar Islands' 'Arunachal Pradesh'
 'Chhattisgarh' 'Jharkhand' 'Uttarakhand' 'North East 1' 'North East 2'
 'North East2' 'North East1' 'Chattisgarh' 'Andaman and Nicobar'
 'Uttaranchal']

In telecom data, “North East 1” and “North East 2” are separate circles covering different states. They may appear multiple times because your dataset likely has different types of connections (e.g., Wireless, Wireline, Prepaid, Postpaid).

How to Work with Them

You have four “types” — probably something like:

Wireless Prepaid

Wireless Postpaid

Wireline

Others

Each type will have its own subscriber counts for North East 1 and North East 2.

It’s a pre-calculated total of subscriber counts across all circles for that particular month/type.

Telecom datasets often include “All India” so analysts don’t have to sum each circle manually every time.

2How It’s Calculated

For example, if you have:

circle	          type	    value

Punjab	         Wireless	1000

Delhi	         Wireless	2000

North East 1	 Wireless	500

All India	     Wireless	3500

In [92]:
df['circle'].value_counts()

circle
All India                         3499
Punjab                            3252
Rajasthan                         3193
Delhi                             3137
Mumbai                            3134
Gujarat                           3102
Kolkata                           3102
Maharashtra                       3102
Karnataka                         3102
Madhya Pradesh                    3099
Uttar Pradesh (East)              3097
Uttar Pradesh (West)              3093
Kerala                            3075
Andhra Pradesh                    3042
Haryana                           3040
Himachal Pradesh                  2976
Odisha                            2958
Bihar                             2951
West Bengal                       2939
Jammu and Kashmir                 2720
Assam                             2716
North East                        2705
Tamil Nadu                        1838
Tamil Nadu (including Chennai)    1263
Chennai                            198
Jharkhand                           64
Arunachal Pradesh                   60
Andaman and Nicobar Islands         60
Chhattisgarh                        60
Uttarakhand                         60
North East 2                        33
North East 1                        33
Chattisgarh                          8
All india                            7
Uttaranchal                          4
Andaman and Nicobar                  4
North East2                          1
North East1                          1
Name: count, dtype: int64

Remove “All India” Rows

“All India” is a pre-calculated total. Keeping it will cause double counting if you sum circles manually.

In [93]:
df = df[df['circle'] != 'All India']

In [94]:
df['circle'] = df['circle'].replace({
    'Andaman and Nicobar': 'Andaman and Nicobar Islands'
})

In [95]:
df.isnull().sum()

year                  0
month                 0
circle                0
type_of_connection    0
service_provider      0
value                 0
dtype: int64

Combine Duplicate Circles

After renaming, the same circle may appear multiple times for the same month/type. Group and sum them:

In [96]:
df['circle'] = df['circle'].fillna("").replace({
    'North East1': 'North East 1',
    'North East2': 'North East 2'
})

df['circle'] = df['circle'].fillna("").replace({
    'Chattisgarh': 'Chhattisgarh'
})

# They are the same circle but with different names (Uttaranchal is old name).
df['circle'] = df['circle'].replace({
    'Uttaranchal': 'Uttarakhand'
})

In [97]:
print(df['circle'].unique())

['Andhra Pradesh' 'Assam' 'Bihar' 'Delhi' 'Gujarat' 'Haryana'
 'Himachal Pradesh' 'Jammu and Kashmir' 'Karnataka' 'Kerala' 'Kolkata'
 'Madhya Pradesh' 'Maharashtra' 'Mumbai' 'North East' 'Odisha' 'Punjab'
 'Rajasthan' 'Tamil Nadu' 'Uttar Pradesh (East)' 'Uttar Pradesh (West)'
 'West Bengal' 'All india' 'Tamil Nadu (including Chennai)' 'Chennai'
 'Andaman and Nicobar Islands' 'Arunachal Pradesh' 'Chhattisgarh'
 'Jharkhand' 'Uttarakhand' 'North East 1' 'North East 2']

In [98]:
df = df[df['circle'] != 'Tamil Nadu (including Chennai)']

In [99]:
print(df['circle'].unique())

['Andhra Pradesh' 'Assam' 'Bihar' 'Delhi' 'Gujarat' 'Haryana'
 'Himachal Pradesh' 'Jammu and Kashmir' 'Karnataka' 'Kerala' 'Kolkata'
 'Madhya Pradesh' 'Maharashtra' 'Mumbai' 'North East' 'Odisha' 'Punjab'
 'Rajasthan' 'Tamil Nadu' 'Uttar Pradesh (East)' 'Uttar Pradesh (West)'
 'West Bengal' 'All india' 'Chennai' 'Andaman and Nicobar Islands'
 'Arunachal Pradesh' 'Chhattisgarh' 'Jharkhand' 'Uttarakhand'
 'North East 1' 'North East 2']

In [100]:
df = df.groupby(['circle', 'type_of_connection', 'year', 'month', 'service_provider'], as_index=False)['value'].sum()

In [101]:
df = df[df['circle'] != 'All india']

In [102]:
print(df['circle'].unique())

['Andaman and Nicobar Islands' 'Andhra Pradesh' 'Arunachal Pradesh'
 'Assam' 'Bihar' 'Chennai' 'Chhattisgarh' 'Delhi' 'Gujarat' 'Haryana'
 'Himachal Pradesh' 'Jammu and Kashmir' 'Jharkhand' 'Karnataka' 'Kerala'
 'Kolkata' 'Madhya Pradesh' 'Maharashtra' 'Mumbai' 'North East'
 'North East 1' 'North East 2' 'Odisha' 'Punjab' 'Rajasthan' 'Tamil Nadu'
 'Uttar Pradesh (East)' 'Uttar Pradesh (West)' 'Uttarakhand' 'West Bengal']

In [103]:
df.head()

,circle,type_of_connection,year,month,service_provider,value
7,Andaman and Nicobar Islands,wireless,2009,April,Aircel,852468
8,Andaman and Nicobar Islands,wireless,2009,April,BSNL,83332
9,Andaman and Nicobar Islands,wireless,2009,April,Bharti Airtel,852468
10,Andaman and Nicobar Islands,wireless,2009,April,HFCL Infotel,852468
11,Andaman and Nicobar Islands,wireless,2009,April,Idea,852468

In [104]:
df.isnull().sum()

circle                0
type_of_connection    0
year                  0
month                 0
service_provider      0
value                 0
dtype: int64

In [105]:
duplicate_rows = df[df.duplicated()]
print(duplicate_rows)

Empty DataFrame
Columns: [circle, type_of_connection, year, month, service_provider, value]
Index: []

In [106]:
dup_check = df[df.duplicated(subset=['circle', 'type_of_connection', 'year', 'month'], keep=False)]
print(dup_check.sort_values(by=['circle', 'year', 'month']))

                            circle type_of_connection  year  month  \
7      Andaman and Nicobar Islands           wireless  2009  April
8      Andaman and Nicobar Islands           wireless  2009  April
9      Andaman and Nicobar Islands           wireless  2009  April
10     Andaman and Nicobar Islands           wireless  2009  April
11     Andaman and Nicobar Islands           wireless  2009  April
...                            ...                ...   ...    ...
65909                  West Bengal           wireline  2025  March
65910                  West Bengal           wireline  2025  March
65911                  West Bengal           wireline  2025  March
65912                  West Bengal           wireline  2025  March
65913                  West Bengal           wireline  2025  March

              service_provider   value
7                       Aircel  852468
8                         BSNL   83332
9                Bharti Airtel  852468
10                HFCL Infotel  852468
11                        Idea  852468
...                        ...     ...
65909  Reliance Communications      21
65910             Reliance Jio  290807
65911                     STPL       0
65912   Tata Telecommunication    2690
65913            Vodafone Idea     150

[65803 rows x 6 columns]

In [107]:
tamil_nadu_total = df[df['circle'] == 'Tamil Nadu']['value'].sum()
print("Tamil Nadu total:", tamil_nadu_total)

chennai_total = df[df['circle'] == 'Chennai']['value'].sum()
print("Chennai total:", chennai_total)

tn_incl_chennai_total = df[df['circle'] == 'Tamil Nadu (including Chennai)']['value'].sum()
print("Tamil Nadu (including Chennai) total:", tn_incl_chennai_total)

print("Sum of Tamil Nadu + Chennai:", tamil_nadu_total + chennai_total)
print("Difference:", tn_incl_chennai_total - (tamil_nadu_total + chennai_total))

Tamil Nadu total: 6456755675
Chennai total: 205246937
Tamil Nadu (including Chennai) total: 0
Sum of Tamil Nadu + Chennai: 6662002612
Difference: -6662002612

In [108]:
print(df.dtypes)

circle                object
type_of_connection    object
year                   int64
month                 object
service_provider      object
value                  int64
dtype: object

In [109]:
df['service_provider'].unique()

array(['Aircel', 'BSNL', 'Bharti Airtel', 'HFCL Infotel', 'Idea',
       'Loop Telecom Pvt. Ltd.', 'MTNL', 'Reliance Communications',
       'Sistema Shyam Teleservices Ltd', 'Spice', 'Tata Teleservices',
       'Vodafone Essar', 'BPL Mobile', 'S-Tel', 'Uninor',
       'Aircel/Dishnet', 'Etisalat/Allianz', 'HFCL', 'Loop', 'Sistema',
       'Unitech', 'Videocon', 'Vodafone', 'Idea/Spice', 'Etisalat',
       'Quadrant (HFCL)', 'Quadrant', 'Telewings', 'Telenor',
       'Reliance Jio', 'BSNL (VNOs)', 'Vodafone Idea',
       'Bharti Airtel (Including Tata Tele.)', 'Reliance', 'Tata',
       'Tata Telecommunication',
       'Bharti Airtel (including Tata Telecommunications)', 'APSFL',
       'V-CON Mobile & Infra Pvt. Ltd.', 'STPL',
       'Systema Shyam Teleservices Ltd.', 'Teleservice Ltd.'],
      dtype=object)

In [110]:
df['service_provider'] = df['service_provider'].replace({
    'Bharti Airtel': 'Airtel',
    'Bharti Airtel (Including Tata Tele.)': 'Airtel',
    'Bharti Airtel (including Tata Telecommunications)': 'Airtel',
    'Vodafone Essar': 'Vodafone-Idea',
    'Vodafone': 'Vodafone-Idea',
    'Idea': 'Vodafone-Idea',
    'Idea/Spice': 'Vodafone-Idea',
    'Vodafone Idea': 'Vodafone-Idea',
    'Reliance Communications': 'Reliance',
    'Reliance Jio': 'Jio',
    'Tata': 'Tata Tele',
    'Tata Telecommunication': 'Tata Tele',
    'Teleservice Ltd.': 'Tata Tele',
    'Sistema Shyam Teleservices Ltd': 'Sistema',
    'Sistema': 'Sistema',
    'HFCL Infotel': 'HFCL',
    'Loop Telecom Pvt. Ltd.': 'Loop',
    'STPL': 'Loop',
    'V-CON Mobile & Infra Pvt. Ltd.': 'V-CON',
    'S-Tel': 'STel'
})

In [111]:
df['service_provider'] = df['service_provider'].replace({
    'Bharti Airtel': 'Airtel',
    'Bharti Airtel (Including Tata Tele.)': 'Airtel',
    'Bharti Airtel (including Tata Telecommunications)': 'Airtel',
    'Vodafone Essar': 'Vodafone-Idea',
    'Vodafone': 'Vodafone-Idea',
    'Idea': 'Vodafone-Idea',
    'Idea/Spice': 'Vodafone-Idea',
    'Reliance Communications': 'Reliance',
    'Reliance Jio': 'Jio',
    'Tata': 'Tata Tele',
    'Tata Telecommunication': 'Tata Tele',
    'Tata Telecommunication Services': 'Tata Tele',
    'Teleservice Ltd.': 'Tata Tele',
    'Sistema Shyam Teleservices Ltd': 'Sistema',
    'Sistema': 'Sistema',
    'Systema Shyam Teleservices Ltd.': 'Sistema',
    'HFCL Infotel': 'HFCL',
    'Loop Telecom Pvt. Ltd.': 'Loop',
    'STPL': 'Loop',
    'V-CON Mobile & Infra Pvt. Ltd.': 'V-CON',
    'S-Tel': 'STel',
    'BSNL (VNOs)': 'BSNL'
})

In [112]:
df['service_provider'].unique()

array(['Aircel', 'BSNL', 'Airtel', 'HFCL', 'Vodafone-Idea', 'Loop',
       'MTNL', 'Reliance', 'Sistema', 'Spice', 'Tata Teleservices',
       'BPL Mobile', 'STel', 'Uninor', 'Aircel/Dishnet',
       'Etisalat/Allianz', 'Unitech', 'Videocon', 'Etisalat',
       'Quadrant (HFCL)', 'Quadrant', 'Telewings', 'Telenor', 'Jio',
       'Tata Tele', 'APSFL', 'V-CON'], dtype=object)

In [113]:
def get_technology(row):
    year = row['year']
    provider = str(row['service_provider']).lower()

    if provider == 'bsnl':
        if year >= 2018:
            return '4G'
        elif year >= 2008:
            return '3G'
        else:
            return '2G'

    elif provider in ['airtel', 'jio', 'vodafone-idea', 'vi']:
        if year >= 2022:
            return '5G'
        elif year >= 2016:
            return '4G'
        elif year >= 2008:
            return '3G'
        else:
            return '2G'

    else:  # Other providers
        if year >= 2016:
            return '4G'
        elif year >= 2008:
            return '3G'
        else:
            return '2G'

df['technology'] = df.apply(get_technology, axis=1)

In [114]:
df.columns

Index(['circle', 'type_of_connection', 'year', 'month', 'service_provider',
       'value', 'technology'],
      dtype='object')

In [115]:
df.tail()

,circle,type_of_connection,year,month,service_provider,value,technology
65909,West Bengal,wireline,2025,March,Reliance,21,4G
65910,West Bengal,wireline,2025,March,Jio,290807,5G
65911,West Bengal,wireline,2025,March,Loop,0,4G
65912,West Bengal,wireline,2025,March,Tata Tele,2690,4G
65913,West Bengal,wireline,2025,March,Vodafone-Idea,150,5G

In [116]:
df.to_csv('telecom_cleaned.csv')